pers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-29 Thu 18:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mkronvold org-mode Personnel notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michael Kronvold" />
<meta name="description" content="Org mode Notes"
 />
<meta name="keywords" content="syntax, org, document" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">mkronvold org-mode Personnel notes</h1>
<p>
:HEADER:
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2ebd28d">1on1</a></li>
</ul>
</div>
</div>
<p>
:END:
</p>

<div id="outline-container-org2ebd28d" class="outline-2">
<h2 id="org2ebd28d">1on1</h2>
<div class="outline-text-2" id="text-org2ebd28d">
</div>
<div id="outline-container-org0e11f03" class="outline-3">
<h3 id="org0e11f03">Kantha</h3>
<div class="outline-text-3" id="text-org0e11f03">
</div>
<div id="outline-container-org8eb7867" class="outline-4">
<h4 id="org8eb7867">6/26/23</h4>
<div class="outline-text-4" id="text-org8eb7867">
</div>
<div id="outline-container-org7727f6d" class="outline-5">
<h5 id="org7727f6d">Bonus Award</h5>
<div class="outline-text-5" id="text-org7727f6d">
<ul class="org-ul">
<li>FY23 bonus
<ul class="org-ul">
<li>5636.70 Ringgits</li>
<li>Paid at end of June payroll</li>
</ul></li>
<li>FY24 Equity
<ul class="org-ul">
<li>RSU's will be granted July 1</li>
<li>Amount will be based on usd $1100</li>
<li>watch for future communication</li>
<li>Shareworks</li>
<li>vest over 3 years, 1/3rd at 1 year anniversary and then 1/12th every 3 months after that</li>
<li>talk to local HR partner for questions/details</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd346d32" class="outline-4">
<h4 id="orgd346d32">6/13/23</h4>
<div class="outline-text-4" id="text-orgd346d32">
<ul class="org-ul">
<li>Shared learning (Kantha)
<ul class="org-ul">
<li>I was stuck, I figured it out, here's how.</li>
<li>Post it in the team chat</li>
<li>Some ideas are good for DCOps, how to share with them?</li>
</ul></li>
<li>We need a team meeting that's just our team</li>
<li>Promotion/raise info, when</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6ff165a" class="outline-3">
<h3 id="org6ff165a">Rajesh</h3>
<div class="outline-text-3" id="text-org6ff165a">
</div>
<div id="outline-container-org752fe87" class="outline-4">
<h4 id="org752fe87">6/28/23</h4>
<div class="outline-text-4" id="text-org752fe87">
</div>
<div id="outline-container-org001d527" class="outline-5">
<h5 id="org001d527">Bonus Award</h5>
<div class="outline-text-5" id="text-org001d527">
<ul class="org-ul">
<li>email
<ul class="org-ul">
<li>I've attached your Corporate Incentive statement and would like to thank you for everything you've brought to the team both before and after moving over to DC Engineering.  It has been a long journey to get this far and we still have a ways to go, but I am confident we have the right folks to make it all work within the special nuances of E2open.</li>
</ul></li>
<li>FY23 bonus
<ul class="org-ul">
<li>9276.92 Ringgits</li>
<li>Paid at end of June payroll</li>
</ul></li>
<li>FY24 Equity
<ul class="org-ul">
<li>RSU's will be granted July 1</li>
<li>Amount will be based on usd $2000</li>
<li>watch for future communication</li>
<li>Shareworks</li>
<li>vest over 3 years, 1/3rd at 1 year anniversary and then 1/12th every 3 months after that</li>
<li>talk to local HR partner for questions/details</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org50c86da" class="outline-5">
<h5 id="org50c86da">too many project start but don't complete</h5>
</div>
<div id="outline-container-orgaee546c" class="outline-5">
<h5 id="orgaee546c">Asked about titles</h5>
</div>
<div id="outline-container-org2da9a5b" class="outline-5">
<h5 id="org2da9a5b">Asked about moving to the U.S.</h5>
<div class="outline-text-5" id="text-org2da9a5b">
</div>
<div id="outline-container-org80b675e" class="outline-6">
<h6 id="org80b675e">Should wait until next year.  new approvals on hold for a while.</h6>
</div>
</div>
</div>
</div>
<div id="outline-container-org21813be" class="outline-3">
<h3 id="org21813be">Me</h3>
<div class="outline-text-3" id="text-org21813be">
</div>
<div id="outline-container-orgc0d7d01" class="outline-4">
<h4 id="orgc0d7d01">6/23/23</h4>
<div class="outline-text-4" id="text-orgc0d7d01">
</div>
<div id="outline-container-org45b8158" class="outline-5">
<h5 id="org45b8158">equity compensation</h5>
<div class="outline-text-5" id="text-org45b8158">
<ul class="org-ul">
<li>bonus $11937 100% of 55.5%</li>
<li>$7000 RSU vest over 3 years, changed from last year (over 12 mo)
<ul class="org-ul">
<li>last year is over 3 x 12 mo periods.  1/3rd per year.</li>
<li>this year first 1/3rd over 12 mo period.  remainder vest 1/12th every 3 mo over next 2 years.</li>
<li>details are all in shareworks</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgde4486b" class="outline-4">
<h4 id="orgde4486b">3/28/23</h4>
<div class="outline-text-4" id="text-orgde4486b">
<ul class="org-ul">
<li>work hours change</li>
<li>adam
<ul class="org-ul">
<li>capacity planning</li>
<li>vsphere/vrops</li>
</ul></li>
<li>Capacity Analysis
<ul class="org-ul">
<li>should meet next week to review desired changes.</li>
</ul></li>
<li>gitops
<ul class="org-ul">
<li>day 2.5 with cdm</li>
<li>does the decision making</li>
<li>doesn't do go/no-go (unless you want)</li>
</ul></li>
<li>mvi/mvp
<ul class="org-ul">
<li>need to start over, ship has sailed.</li>
<li>talk about platform as a product</li>
<li>vs what platform as a service is</li>
</ul></li>
<li>goals
<ul class="org-ul">
<li>personal</li>
<li>DCEng</li>
<li>VMware initiatives</li>
<li><a href="https://i.imgur.com/C0vDUYF.png%0D">https://i.imgur.com/C0vDUYF.png%0D</a></li>
</ul></li>
<li>incident manager
<ul class="org-ul">
<li>better, but not comfortable at all.</li>
<li>I'll be honest, I deal with the intensity and stress of this job largely due to the flexibility of it&#x2026; commitments that are likely to interfere with my own time are going to make these things harder to deal with.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Michael Kronvold</p>
<p class="date">Created: 2023-06-29 Thu 18:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
